Repository: saleem72/epsilon_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# app_name
source: Epsilon
ar: ابسيلون

source: Login
ar: تسجيل الدخول

source: User name
ar: اسم المستخدم

# user_name_hint
source: enter user name
ar: أدخل اسم المستخدم

source: Password
ar: كلمة المرور

# password_hint
source: enter password
ar: أدخل كلمة المرور

# ok_button
source: Ok
ar: ادخال

# try_again
source: Try agian
ar: حاول مجددا

source: Pick company
ar: اختر الشركة

source: Database URL
ar: رابط قاعدة البيانات

# database_url_hint
source: enter Database URL
ar: أدخل رابط قاعدة البيانات

source: Database name
ar: اسم قاعدة البيانات

# database_name_hint
source: enter Database name
ar: أدخل اسم قاعدة البيانات

# database_port
source: Port
ar: البوابة

# database_port_hint
source: enter port
ar: أدخل البوابة

source: Company
ar: الشركة

# company_hint
source: choose company
ar: اختر اسم الشركة

source: Alameen
ar: الامين

source: Almanarah
ar: المنارة

# operation_title
source: Home
ar: الصفحة الرئيسية

# operation_subject
source: Query Product
ar: الإستعلام عن صنف

# operation_customer
source: Query Customer
ar: كشف حساب زبون

# operation_voucher
source: Query Voucher
ar: إدخال سندات قبض ودفع

# operation_bill
source: Query Bill
ar: إدخال فاتورة

# query_subject_screen
source: Product Code
ar: رمز الاستجابة السريعة

# or_label
source: Or
ar: أو

source: Serial Number
ar: الرقم التسلسلي

# serial_number_hint
source: enter serial number
ar: أدخل الرقم التسلسلي

# subject_id
source: Product ID
ar: رمز المادة

# subject_name
source: Product Name
ar: اسم المادة

# subject_properties
source: Qalifications
ar: المواصفات

# subject_price_one
source: Price 1
ar: سعر الوحدة 1

# subject_price_tow
source: Price 2
ar: سعر الوحدة 2

# subject_store
source: Store
ar: المستودع

# empty_username
source: user name is mandatory field
ar: اسم المستخدم حقل اجباري

# short_username
source: user name should be atleaste 4 char
ar: اسم المستخدم يجب ان يكون ٤ محارف على الأقل

# empty_password
source: user name is mandatory field
ar: كلمة المرور حقل اجباري

# short_password
source: user name should be atleaste 4 char
ar: كلمة المرور يجب ان يكون ٤ محارف على الأقل

source: Invalid username or password
ar: تحقق من البيانات

source: No Internet Connection
ar: تحقق من اتصالك بالانترنت

# connection_failure
source: Check your connection then try again later
ar: تحقق من اتصالك بالانترنت واعد الحاولة لاحقاً

source: Decoding Failure
ar: بعض البيانات معطوبة

# unexpected_failure
source: Some thing bad happend/nplease try again later
ar: حدث خطأ ما الرجاء المحاولة لاحقاً

# fail_to_connect_db
source: Fail To Connect your database
ar: حدث خطأ عند محاولة الاتصال بقاعدة البيانات الرجاء تأكد من بياناتك ثم اعد المحاولة
